Revit 2027 API
OverrideGraphicSettings.ProjectionLineWeight Property
 The projection surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ProjectionLineWeight { get; }
Public ReadOnly Property ProjectionLineWeight As Integer
	Get
public:
property int ProjectionLineWeight {
	int get ();
}
member ProjectionLineWeight : int with get
Property Value
Int32
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace